
text = """
贺卡实打实的空间阿什顿拉萨回到拉萨客户端撒了客户端打死你了到那时的离开你撒的离开你打什么；达拉斯来的CPU的架构

CPU内部含有一些微指令，软件都要经过CPU内部的微指令集的处理。这些指令集的设计分为两种设计理念，也就是目前世界上最常见的两种主要的CPU架构：\

1、精细指令集（RISC）:
  有代表性的：手机、导航系统、网络设备（交换器、路由器等）几乎都使用ARM架构的CPU等
2、复杂指令集（CISC） :
  有代表性的：intel、AMD、VIA等的x86架构CPU（为什么称为x86？：因为最早的那颗intel发展出来的CPU代号为8086，后来依次架构又开发了很多以xxx86为名字的架构，所以这种架构的CPU就被称为x86架构）\

CPU的超频：将CPU的倍频或者是外频通过主板的设置功能更改成较高频率的一种方式。但因为CPU的倍频通常在出厂时已经被锁定而无法修改， 因此较常被超频的为外频。在早期的 CPU 设计中，所谓的外频指的是CPU与外部元件进行数据传输时的速 度，倍频则是 CPU 内部用来加速工作性能的一个倍数， 两者相乘才是CPU的频率速度。

驱动马达转动盘片会数据的读取延迟， SSD作为系统盘、HDD作为数据载体。

计算机的定义为：“接受使用者输入指令与数据，经由中央处理器的数学与逻辑单元运算处理后，以产生或储存成有用的信息”；
电脑的五大单元包括：输入单元、输出单元、控制单元、算数逻辑单元、存储单元五大 部分。其中CPU占有控制、算术逻辑单元，存储单元又包含内存与辅助内存；
数据会流进/流出内存是CPU所发布的控制命令，而CPU实际要处理的数据则完全来自于 内存；
CPU依设计理念主要分为：精简指令集（RISC）与复杂指令集（CISC）系统； 关于CPU的频率部分：外频指的是CPU与外部元件进行数据传输时的速度，倍频则是 CPU内部用来加速工作性能的一个倍数， 两者相乘才是CPU的频率速度；
新的 CPU 设计中，已经将北桥的内存控制芯片整合到 CPU 内，而 CPU 与内存、显卡 沟通的总线通常称为系统总线。 南桥就是所谓的输入输出（I/O）总线，主要在联系硬 盘、USB、网卡等周边设备；
CPU每次能够处理的数据量称为字组大小（word size），字组大小依据CPU的设计而有32位与64位。 我们现在所称的电脑是32或64位主要是依据这个 CPU解析的字组大小而来的！个人电脑的内存主要元件为动态随机存取内存（Dynamic Random Access Memory,DRAM）， 至于CPU内部的第二层高速缓存则使用静态随机存取内存（Static Random Access Memory, SRAM）；
BIOS（Basic Input Output System）是一套程序，这套程序是写死到主板上面的一个内存芯片中， 这个内存芯片在没有通电时也能够将数据记录下来，那就是只读存储器（Read Only Memory, ROM）；
目前主流的外接卡接口大多为 PCIe 接口，且最新为 PCIe 3.0，单信道速度高达 1GBytes/s常见的显卡连接到屏幕的接口有 HDMI/DVI/D-Sub/Display port 等等。HDMI 可同时传送影像与声音。传统硬盘的组成为：圆形盘片、机械手臂、 磁头与主轴马达所组成的，其中盘片的组成为扇区、磁道与柱面；
磁盘连接到主板的接口大多为 SATA 或 SAS，目前台式机主流为 SATA 3.0，理论极速可 达 600MBytes/s。
常见的文字编码为 ASCII，繁体中文编码主要有 Big5 及 UTF8 两种，目前主流为 UTF8 操作系统（Operating System, OS）其实也是一组程序， 这组程序的重点在于管理电脑 的所有活动以及驱动系统中的所有硬件。
电脑主要以二进制作为单位，常用的磁盘容量单位为Bytes，其单位换算为1 Byte = 8bits。
最阳春的操作系统仅在驱动与管理硬件，而要使用硬件时，就得需要通过应用软件或者 是壳程序（shell）的功能， 来调用操作系统操纵硬件工作。目前称为操作系统的，除了 上述功能外，通常已经包含了日常工作所需要的应用软件在内了。

学一样东西和教人一样东西是不一样的。
Linux：图形接口、shell"    
"""

dic = {}
for single in text:
    if single in dic.keys():
        dic[single] =  dic[single] + 1
    else:
        dic[single] = 1    

print(dic)